results/verified/2026-08-11/controller-mvex/joint-precision-four-config-mvex-r2-20260811/attempt/samples/full__random__r30__s7/bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f847064c360>, trust_remote_code=False, seed=7, num_prompts=1800, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/root/autodl-tmp/caches/modelscope/models/Qwen--Qwen3.5-2B/snapshots/master', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=30.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=120, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['attempt_id=joint-precision-four-config-mvex-r2-20260811', 'sample_id=full__random__r30__s7', 'allocation=full', 'workload=random', 'seed=7', 'offered_rate=30', 'measurement_window_s=60', 'contract_sha256=48e517b578225b26a4b7820d44fbf088d9679505823812320c939c18185bb0d9', 'git_commit=b3cdfd9042742a66c35619149159d260a6879097', 'vllm_source_commit=e2fa28594f7baad142a426b0b6a2cfe2c79201c7'], result_dir='/root/autodl-tmp/controller-calibration-r2-20260811/joint-precision-four-config-mvex-r2-20260811/samples/full__random__r30__s7/work', result_filename='result.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='50,95,99', goodput=['ttft:3000', 'tpot:200'], request_id_prefix='full__random__r30__s7-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-11 20:39:35 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 120 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 30.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1800      
Failed requests:                         0         
Request rate configured (RPS):           30.00     
Benchmark duration (s):                  60.96     
Total input tokens:                      1843200   
Total generated tokens:                  230400    
Request throughput (req/s):              29.53     
Request goodput (req/s):                 29.53     
Output token throughput (tok/s):         3779.65   
Peak output token throughput (tok/s):    6945.00   
Peak concurrent requests:                123.00    
Total token throughput (tok/s):          34016.86  
---------------Time to First Token----------------
Mean TTFT (ms):                          133.43    
Median TTFT (ms):                        129.67    
P50 TTFT (ms):                           129.67    
P95 TTFT (ms):                           192.66    
P99 TTFT (ms):                           218.58    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.88     
Median TPOT (ms):                        14.94     
P50 TPOT (ms):                           14.94     
P95 TPOT (ms):                           17.80     
P99 TPOT (ms):                           18.28     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.67     
Median ITL (ms):                         8.72      
P50 ITL (ms):                            8.72      
P95 ITL (ms):                            33.83     
P99 ITL (ms):                            37.97     
==================================================